Cerberus-Robotica/Robot_STM32F4/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <math.h>
#include <stdio.h>
#include <string.h>
#include <inttypes.h>
#include "NRF24.h"
#include "NRF24_reg_addresses.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

#pragma pack(push, 1)
typedef struct {
    uint8_t id;
    float Vx, Vy, Vang;
    uint8_t kicker;
} Pacote;
#pragma pack(pop)

const uint8_t id = 5;
volatile float vx = 0;
volatile float vy = 0;
volatile float vang = 0;
volatile uint8_t kicker = 0;


uint8_t addr[5] = {'A', 'S', 'U', 'R', 'T'};
uint8_t channel = 123;
uint8_t pld_size = sizeof(Pacote);
volatile uint8_t radio_timeout = 0;


const uint32_t ARR = 1000;
const float R = 1.0;
const float Rr = 1.0;
const float velocidade_maxima_motor = 29.32153; // rads/segundo de 280rmp
const float a1 = 0.785398;   // 45°
const float a2 = 2.35619;  // 135°
const float a3 = 3.92699; // 225°
const float a4 = 5.49779;  // 315°





/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define PWM_MOTOR1_CHANNEL TIM_CHANNEL_1
#define PWM_MOTOR1_TIMER &htim1

#define PWM_MOTOR2_CHANNEL TIM_CHANNEL_2
#define PWM_MOTOR2_TIMER &htim3

#define PWM_MOTOR3_CHANNEL TIM_CHANNEL_1
#define PWM_MOTOR3_TIMER &htim3

#define PWM_MOTOR4_CHANNEL TIM_CHANNEL_1
#define PWM_MOTOR4_TIMER &htim2

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */


/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim11;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM11_Init(void);
static void MX_TIM3_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART2_UART_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void radio_setup() {
	  ce_high();
	  HAL_Delay(5);
	  ce_low();

	  nrf24_init();

	  nrf24_auto_ack_all(auto_ack);
	  nrf24_en_ack_pld(disable);
	  nrf24_dpl(disable);

	  nrf24_tx_pwr(_0dbm);
	  nrf24_data_rate(_1mbps);
	  nrf24_set_channel(channel);
	  nrf24_set_addr_width(5);

	  nrf24_pipe_pld_size(0, pld_size);
	  nrf24_set_crc(en_crc, _1byte);

	  nrf24_auto_retr_delay(4);
	  nrf24_auto_retr_limit(10);

	  nrf24_open_tx_pipe(addr);
	  nrf24_open_rx_pipe(0, addr);

	  nrf24_listen();

	  ce_high();
	  HAL_Delay(5);
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM11)
    {
        if (radio_timeout == 0)
        {
            vx = 0;
            vy = 0;
            vang = 0;
            kicker = 0;
        }
        else
        {
            radio_timeout = 0; // Sinal de que rádio está funcionando
        }
    }
}




void acionar_motor(int motor, float dutycycle){
	TIM_HandleTypeDef *htim = NULL;
	uint32_t channel = 0;
	GPIO_TypeDef* GPIOx0 = NULL;
	uint16_t GPIO_Pinx0 = 0;
	GPIO_TypeDef* GPIOx1 = NULL;
	uint16_t GPIO_Pinx1 = 0;


	switch(motor){
	case 1:
		htim = PWM_MOTOR1_TIMER;
		channel = PWM_MOTOR1_CHANNEL;
		GPIOx0 = SENTIDO0_MOTOR1_GPIO_Port;
		GPIO_Pinx0 = SENTIDO0_MOTOR1_Pin;
		GPIOx1 = SENTIDO1_MOTOR1_GPIO_Port;
		GPIO_Pinx1 = SENTIDO1_MOTOR1_Pin;
		break;
	case 2:
		htim = PWM_MOTOR2_TIMER;
		channel = PWM_MOTOR2_CHANNEL;
		GPIOx0 = SENTIDO0_MOTOR2_GPIO_Port;
		GPIO_Pinx0 = SENTIDO0_MOTOR2_Pin;
		GPIOx1 = SENTIDO1_MOTOR2_GPIO_Port;
		GPIO_Pinx1 = SENTIDO1_MOTOR2_Pin;
			break;
	case 3:
		htim = PWM_MOTOR3_TIMER;
		channel = PWM_MOTOR3_CHANNEL;
		GPIOx0 = SENTIDO0_MOTOR3_GPIO_Port;
		GPIO_Pinx0 = SENTIDO0_MOTOR3_Pin;
		GPIOx1 = SENTIDO1_MOTOR3_GPIO_Port;
		GPIO_Pinx1 = SENTIDO1_MOTOR3_Pin;
			break;
	case 4:
		htim = PWM_MOTOR4_TIMER;
		channel = PWM_MOTOR4_CHANNEL;
		GPIOx0 = SENTIDO0_MOTOR4_GPIO_Port;
		GPIO_Pinx0 = SENTIDO0_MOTOR4_Pin;
		GPIOx1 = SENTIDO1_MOTOR4_GPIO_Port;
		GPIO_Pinx1 = SENTIDO1_MOTOR4_Pin;
			break;
	default:
		return;
	}
	int sentido = 0;
	if (dutycycle < 0){
		HAL_GPIO_WritePin(GPIOx0, GPIO_Pinx0, GPIO_PIN_SET);
		HAL_GPIO_WritePin(GPIOx1, GPIO_Pinx1, GPIO_PIN_RESET);
		dutycycle = -dutycycle;
		sentido = -1;
	}
	else {
		HAL_GPIO_WritePin(GPIOx0, GPIO_Pinx0, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOx1, GPIO_Pinx1, GPIO_PIN_SET);
		sentido = 1;
	}
	if (dutycycle == 0){
		HAL_GPIO_WritePin(GPIOx0, GPIO_Pinx0, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(GPIOx1, GPIO_Pinx1, GPIO_PIN_RESET);
	}


	if (dutycycle > 100.0f){
		dutycycle = 100.0f;
	}

	uint32_t frequencia = (uint32_t)((dutycycle / 100.0f) * (ARR));
	__HAL_TIM_SET_COMPARE(htim, channel, frequencia);
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

