Cerberus-Robotica/Robot_STM32F4/Core/Src/main.c
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI1_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_TIM11_Init();
  MX_TIM3_Init();
  MX_I2C1_Init();
  MX_USART2_UART_Init();
  /* USER CODE BEGIN 2 */
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);

  //radio configuration
  radio_setup();
  HAL_TIM_Base_Start_IT(&htim11);
  //UART variables
  char received_char[1];
  received_char[0] = 'a';
  char msg[64];

  //Radio variables
  uint8_t rx_buffer[pld_size];
  Pacote pacote_recebido;

  //cinematics variables

  float J[4][3] = {
  	  	    {-sin(a1), cos(a1), R},
  	  	    {-sin(a2), cos(a2), R},
  	  	    {-sin(a3), cos(a3), R},
  	  	    {-sin(a4), cos(a4), R}
  	  	  };
  HAL_GPIO_WritePin(LED_AZUL_GPIO_Port, LED_AZUL_Pin, GPIO_PIN_SET);
  HAL_UART_Transmit(&huart2, (uint8_t*)"Iniciado!", strlen("Iniciado!"), 100);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
	  pacote_recebido.Vx = 0;
	  pacote_recebido.Vy = 0;
	  pacote_recebido.Vang = 0;
	  pacote_recebido.id = -1;
	  pacote_recebido.kicker = 0;

	 if (HAL_UART_Receive(&huart2, received_char, 1, 10) == HAL_OK) {
	  	  	  HAL_UART_Transmit(&huart2, (uint8_t*)"Eco: ", strlen("Eco: "), 100);
	  	  	  HAL_UART_Transmit(&huart2, received_char, 1, 100);
	  	  	  HAL_UART_Transmit(&huart2, (uint8_t*)"\r\n", 2, 100); // Envia nova linha
	  	  }
	  if(nrf24_data_available()) {
		  	  nrf24_receive(rx_buffer, pld_size);
		  	  memcpy(&pacote_recebido, rx_buffer, sizeof(Pacote));
		  	  if(pacote_recebido.id == id){
		  		  snprintf(msg, sizeof(msg), "Radio: %d %.2f %.2f %.2f %d\r\n", pacote_recebido.id, pacote_recebido.Vx, pacote_recebido.Vy,pacote_recebido.Vang,pacote_recebido.kicker);
		  	  	  HAL_UART_Transmit(&huart2, (uint8_t*)msg, strlen(msg), 100);
		  	  	  vx = pacote_recebido.Vx;
		  	  	  vy = pacote_recebido.Vy;
		  	  	  vang = pacote_recebido.Vang;
		  	  	  kicker = pacote_recebido.kicker;
		  	  	  radio_timeout = 1;
		  	  	  HAL_GPIO_WritePin(LED_AZUL_GPIO_Port, LED_AZUL_Pin, GPIO_PIN_RESET);
		  	  } else {
		  		HAL_GPIO_WritePin(LED_AZUL_GPIO_Port, LED_AZUL_Pin, GPIO_PIN_SET);
		  		radio_timeout = 0;
		  	  }
	  } else {
		  radio_timeout = 0;
		  HAL_GPIO_WritePin(LED_AZUL_GPIO_Port, LED_AZUL_Pin, GPIO_PIN_SET);
	  }
	  if(kicker  > 8 && kicker < 12){
		  HAL_Delay(4000);
		  for(int i = 0; i<4; i++){
			  acionar_motor(i+1, 1000);
			  HAL_Delay(1000);
			  acionar_motor(i+1, 0);
			  HAL_Delay(1000);
			  acionar_motor(i+1, -1000);
			  HAL_Delay(1000);
			  acionar_motor(i+1, 0);
		  }
		  continue;
	  }
	  if(kicker  > 14 && kicker < 16){
	  		  HAL_Delay(4000);
	  		  for(int i = 0; i<4; i++){
	  			  acionar_motor(1, 1000);
	  			  HAL_Delay(1000);
	  			  acionar_motor(1, 0);
	  			  acionar_motor(2, 1000);
	  			  HAL_Delay(1000);
	  			  acionar_motor(2, 0);
	  			  acionar_motor(3, 1000);
	  			  HAL_Delay(1000);
	  			  acionar_motor(3, 0);
	  			  acionar_motor(4, 1000);
	  			  HAL_Delay(1000);
	  			  acionar_motor(4, 0);
	  		  }
	  		  continue;
	  	  }
	  if(kicker > 18 && kicker < 22){
		  	for(int i = 0; i<11; i++){
	  			  acionar_motor(1, i*10);
	  			  acionar_motor(2, i*10);
	  			  acionar_motor(3, i*10);
	  			  acionar_motor(4, i*10);
	  			  HAL_Delay(2000);
	  		}
	  		for(int i = 0; i<11; i++){
	  			  acionar_motor(1, -i*10);
	  			  acionar_motor(2, -i*10);
	  			  acionar_motor(3, -i*10);
	  			  acionar_motor(4, -i*10);
	  			  HAL_Delay(2000);
	  		}
	  		continue;
	  }

	  float velocidade_angular[4];
	  for (int i = 0; i < 4; i++) {
	      velocidade_angular[i] = ((1 / Rr) * (J[i][0] * vx + J[i][1] * vy + J[i][2] * vang));
	  }
	  float max_val = 0.0f;
	  float velocidade_minima_motor = 0.2f*velocidade_maxima_motor; // 20% da velocidade máxima
	  float min_val = 10000;

	  // 1. Descobrir o valor máximo e mínimo absolutos
	  for (int i = 0; i < 4; i++) {
	      float abs_val = fabs(velocidade_angular[i]);
	      if (abs_val > max_val) max_val = abs_val;
	      if (abs_val < min_val && abs_val > 0) min_val = abs_val;
	  }

	  // 2. Escalar para não passar do máximo
	  if (max_val > velocidade_maxima_motor) {
	      float escala = velocidade_maxima_motor / max_val;
	      for (int i = 0; i < 4; i++) {
	          velocidade_angular[i] *= escala;
	      }
	      // Recalcula min_val após o ajuste
	      min_val = 10000;
	      for (int i = 0; i < 4; i++) {
	          float abs_val = fabs(velocidade_angular[i]);
	          if (abs_val < min_val && abs_val > 0) min_val = abs_val;
	      }
	  }

	  // 3. Escalar para que o mínimo seja pelo menos o desejado
	  if (min_val < velocidade_minima_motor && min_val > 0) {
	      float escala = velocidade_minima_motor / min_val;
	      for (int i = 0; i < 4; i++) {
	          velocidade_angular[i] *= escala;
	      }
	  }
	  acionar_motor(1, 100.0f*velocidade_angular[0]/velocidade_maxima_motor);
	  acionar_motor(2, 100.0f*velocidade_angular[1]/velocidade_maxima_motor);
	  acionar_motor(3, 100.0f*velocidade_angular[2]/velocidade_maxima_motor);
	  acionar_motor(4, 100.0f*velocidade_angular[3]/velocidade_maxima_motor);

  }
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 80;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief I2C1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2C1_Init(void)
{

  /* USER CODE BEGIN I2C1_Init 0 */

  /* USER CODE END I2C1_Init 0 */

